Repository: ngphuctoan/schedule-cli
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: vi

source: Your student ID.
vi: Mã sinh viên của bạn.

source: Your password.
vi: Mật khẩu của bạn.

source: The semester ID.
vi: ID học kỳ.

source: Any date within the specified week (format: DD/MM/YYYY) - Defaults to today.
vi: Bất kỳ ngày nào trong tuần được chỉ định (định dạng: DD/MM/YYYY) - Mặc định là hôm nay.

source: No account is set - Please run `%(command)s` first!
vi: Chưa thiết lập tài khoản - Vui lòng chạy `%(command)s` trước!

source: Using the provided account instead of local storage.
vi: Sử dụng tài khoản được cung cấp thay vì lưu trữ.

source: Unknown semester ID: %(id)s - Use `%(command)s` to list all semesters.
vi: ID học kỳ không xác định: %(id)s - Sử dụng `%(command)s` để xem tất cả học kỳ.

source: Found semester '%(name)s' - Fetching the schedule...
vi: Đã tìm thấy học kỳ '%(name)s' - Đang lấy thời khóa biểu...

source: Invalid student ID or password!
vi: Mã sinh viên hoặc mật khẩu không hợp lệ!

source: Something went wrong.
vi: Có lỗi xảy ra.

source: Fetch all semesters.
vi: Lấy tất cả học kỳ.

source: Found %(count)d semesters - Displaying the table:
vi: Đã tìm thấy %(count)d học kỳ - Hiển thị bảng:

source: All semesters
vi: Tất cả học kỳ

source: Name
vi: Tên

source: Save your Student Portal account locally.
vi: Lưu tài khoản Cổng thông tin sinh viên của bạn trên máy.

source: Your account has been saved!
vi: Tài khoản đã được thiết lập!

source: View the table of the schedule.
vi: Xem bảng thời khóa biểu.

source: Found 1 entry - Displaying the table:
vi: Đã tìm thấy %(count)d lớp học - Hiển thị bảng:

source: Your schedule (%(start_date)s - %(end_date)s)
vi: Thời khóa biểu (%(start_date)s - %(end_date)s)

source: Course
vi: Môn học

source: Room
vi: Phòng

source: Weekday
vi: Thứ

source: Period
vi: Tiết bắt đầu

source: Duration
vi: Số tiết

source: Group
vi: Nhóm

source: Sub group
vi: Tổ

source: Is absent
vi: Báo vắng

source: Export the schedule as JSON.
vi: Xuất thời khóa biểu sang định dạng JSON.

source: The specified file path. Must be non-existing.
vi: Đường dẫn tệp được chỉ định. Tệp không được phép tồn tại.

source: Schedule has been fetched! Exporting to %(path)s...
vi: Thời khóa biểu đã được lấy! Đang xuất tới %(path)s...

source: Exported successfully!
vi: Xuất thành công!

source: Failed to export.
vi: Có lỗi khi xuất.
